{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.3", "signature": {"inputs": {"lstm_3_input:0": {"name": "lstm_3_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "25"}, {"size": "36"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "lstm_3_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "25"}, {"size": "36"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/Shape", "op": "Shape", "input": ["lstm_3_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/packed/1", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/Const", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose/perm", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^lstm_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_3_input", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/Shape", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_81"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_74"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_72"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/strided_slice", "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/packed", "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_79"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/zeros_1", "^lstm_3_input"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/zeros_1", "^lstm_3_input"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2xzdG1fMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_77"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_76"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_75"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/cond/_23/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_42", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/cond/_23/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_counter_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_14_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_13_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_counter_switch/_48:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/exit/_63", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1_switch/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15_switch/_56:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16_switch/_57:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17_switch/_58:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/input/_99", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time_switch/_50:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_switch/_54:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_13_switch/_52:1", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16_switch/_57:1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/exit/_63", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/input/_99", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/input/_99", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_counter_switch/_48:1", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack", "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15_switch/_56:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_2", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_3", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/MatMul", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_6/Relu", "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17_switch/_58:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_3/dense_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split/split_dim", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/dense_7/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_14_switch/_53:1", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_1", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Sigmoid_2", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul_2", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1_switch/_51:1", "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/input/_99", "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_15", "shape": [36, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_16", "shape": [128, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/input/_17", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "shape": [128, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/lstm_3/PartitionedCall/while/body/_24/while/split/split_dim", "shape": [], "dtype": "int32"}]}]}